using System;

namespace _11_Task_How_many_zeros
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Напишете програма, която пресмята с колко нули завършва факториелът на дадено число. Примери:
             *  N = 10 -> N! = 3628800 -> 2
             *  N = 20 -> N! = 2432902008176640000 -> 4
             *Упътване: Броят на нулите в края на n! зависи от това, колко пъти числото 10 е делител на факториела.
             *Понеже произведението 1*2*3…*n има повече на брой делители 2, отколкото 5, а 10 = 2 * 5, то броят нули в n! е 
             *точно толкова, колкото са множителите със стойност 5 в произведе­нието 1*2*3….*n. Понеже всяко пето число се
             *дели на 5, а всяко 25-то число се дели на 5 двукратно и т.н., то броя нули в n! е сумата: n/5 + n/25 + n/125 + … */

            Console.Write("Enter N: ");
            decimal n = Int32.Parse(Console.ReadLine());
            int zeroes = 0;

            for (int i = (int)(n - 1); i > 0; i--)
                n *= i;

            Console.Write("N! is {0} and it ends ", n);

            do
            {
                n /= 10;
                zeroes++;
            } while (n % 10 == 0);

            Console.WriteLine("with {0} zeroes.", zeroes);
        }
    }
}
