using System;

namespace _05_Task_Fibonacci
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Напишете програма, която чете от конзолата числото N и отпечатва сумата на първите N члена от редицата на Фибоначи:
             * 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, ...
             * Упътване: Числата на Фибоначи започват от 0 и 1, като всяко следващо се получава като сума от предходните две.
             * Можете да намерите първите n числа на Фибоначи с for цикъл от 1 до n, като на всяка итерация пресмятате поредното число,
             * използвайки предходните две (които ще пазите в две допълнителни променливи).*/

            int num1 = 0, num2 = 1, num3 = 0;

            Console.Write("Enter N: ");
            int length = Int32.Parse(Console.ReadLine());

            Console.Write("0, 1,");

            for (int i = 2; i < length; i++)
            {
                num3 = num1 + num2;
                Console.Write(" {0},", num3);
                num1 = num2;
                num2 = num3;
            }
        }
    }
}
